Public Attributes | List of all members
API_ColumnType Struct Reference
Element Manager
Represents a column element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 short  | corePen
The pen color index of the core.
 API_OverriddenPen  | cutFillPen
Cut fill pens set in the used structure (building material, complex profile) can be overridden on the element level.
 API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the used structure (building material, complex profile) can be overridden on the element level.
 short  | belowViewLinePen
Pen index of the uncut lines.
 API_AttributeIndex  | belowViewLineType
The line type of the uncut lines.
 API_AttributeIndex  | contLtype
The line type of the core.
 bool  | wrapping
Defines the wall wrapping. If true, the wall wraps around the column.
 API_ZoneRelID  | zoneRel
Defines the column's relation to zones (see API_ZoneRelID).
short  | coreSymbolType
Determines the display of the column on the floor plan:
 short  | coreAnchor
Anchor point of the core. |0|1|2| |3|4|5| |6|7|8|.
 double  | height
The height of the column.
 double  | bottomOffset
The column base level relative to the floor level.
 double  | topOffset
The offset from top floor if column is top linked.
 API_AttributeIndex  | venLineType
The line type index of veneer line.
 short  | venLinePen
The color index of veneer line.
 short  | coreSymbolPen
The color index of column cross line.
 double  | coreSymbolPar1
The length of the crosshair outside the column's contour line.
 double  | coreSymbolPar2
The distance of the crosshair from the column's center.
 API_StoryVisibility  | visibility
Defines on which floor the given element is visible (see API_StoryVisibility)
 API_LinkToSettings  | linkToSettings
Mode of linking to home story.
 short  | relativeTopStory
The top linked story (relative to home story). Negative values are invalid. 0 = not top linked.
 API_AttributeIndex  | hiddenLineType
Hidden line type.
 short  | hiddenLinePen
Hidden line pen.
 API_Coord  | origoPos
The position of the column.
 double  | axisRotationAngle
The angle of rotation around the axis of the column (in radian)
 API_AttributeIndex  | aboveViewLineType
Linetype of the overhead lines.
 short  | aboveViewLinePen
Pen index of the overhead lines.
 bool  | isAutoOnStoryVisibility
If set to true, the application will automatically provide the story dependent visibility of the element (if the element is physically on a story, it will be shown on that story)
 bool  | isSlanted
Defines whether the column is slanted or vertical.
 bool  | isFlipped
Flipped column.
 double  | slantAngle
Slant angle (in radian)
 double  | slantDirectionAngle
The rotation angle of the slanted column on the horizontal plane (in radians)
 API_ElemDisplayOptionsID  | displayOption
Display options of the element on the floor plan.
 API_ElemViewDepthLimitationsID  | viewDepthLimitation
Defines the range within the element is shown on the floor plan .
 UInt32  | nCuts
Number of cuts.
 UInt32  | nSegments
Number of segments.
 UInt32  | nSchemes
Number of schemes.
 UInt32  | nProfiles
Number of profiles.
 bool  | useCoverFill
Use Floor plan fill.
 bool  | useCoverFillFromSurface
Use the fill attribute assigned to the surface material of the element.
 bool  | coverFillOrientationComesFrom3D
Use cover fill orientation from 3D element view.
 API_AttributeIndex  | coverFillType
Fill type of the cover fill.
 short  | coverFillForegroundPen
Foreground pen of the cover fill.
 short  | coverFillBackgroundPen
Background pen of the cover fill.
 API_CoverFillTransformationTypeID  | coverFillTransformationType
TransformationType of the fill.
 API_CoverFillTransformation  | coverFillTransformation
Orientation and distortion parameters of the cover fill.
Detailed Description
Represents a column element.
Remarks
In Archicad 17, the elements' structure type is defined with the new modelElemStructureType member. The related attribute indices are separated into buildingMaterial and profileAttr. In Archicad 17, the elements' cut fill foreground and background pens inherit from the element structure and can be overridden onthe element level. In Archicad 17, the elements' surface materials inherit from the element structure and can be overridden on the element level. For column-related memo data, see the ACAPI_Element_GetMemo function.
Member Data Documentation
◆ coreSymbolType
 API_ColumnType::coreSymbolType
Determines the display of the column on the floor plan:
 Value  | Meaning
 1  | Plain
 2  | Slash
 3  | X
 4  | CrossHair